{
	"home": "Home",
	"projects": "Projects",
	"skills": "Skills",
	"contact": "Contact",
	"welcome": "Welcome to My Digital World!",
	"name": "I'm Sergiu Tudos",
	"about-me": "More about me",
	"about": "About Me",
	"description-one": "Hi! I'm Sergiu Tudos, a passionate frontend developer, always eager to learn and create innovative projects. I work with technologies like React, TypeScript, Vite, and Tailwind, building intuitive and dynamic user interfaces. I enjoy solving problems through code and optimizing user experiences.",
	"description-two": "Besides programming, I’m involved in organizing and managing FIFA 11 tournaments, where I build dynamic leaderboards, integrate custom functionalities, and constantly look for ways to enhance the player experience. Recently, I started exploring the creation of Discord bots to automate score updates in my competitions.",
	"description-three": "My goal is to become a skilled web developer, refine my knowledge, and create projects that bring value to the community.",
	"my-projects": "My Projects",
	"snake": "Snake Game",
	"snake-about": "Snake Game is my first project built with TypeScript. I developed it using React and learned concepts such as state management with hooks and grid-based movement mechanics. I implemented collision detection, apple generation, and snake growth with each point earned. This project helped me better understand TypeScript typing and apply fundamental principles of interactive development.",
	"fifa": "Fifa Tournaments",
	"fifa-about": "My tournament website was my first major project in React, and it’s the one I’ve worked on the most. I built a complex platform for 50-100 players who compete throughout the year. I implemented data retrieval from AWS buckets and integrated it into the leaderboard table. Additionally, I developed a Discord bot running on an AWS server, which allows players to submit their scores and automatically updates the standings. This project has been a great learning experience in frontend development, API integration, and real-time data management.",
	"horoscope": "Horoscope Site",
	"horoscope-about": "Zodiak was my first project built with Vite, JavaScript, HTML, and CSS, and it was also the first one for which I purchased a domain and made publicly available for horoscope enthusiasts. I integrated an API using ChatGPT via AWS Lambda, which generates a daily prediction for each zodiac sign. Additionally, I optimized the site for SEO to improve visibility and reach a wider audience. This project was a great learning experience in API integration, serverless functions, and web performance optimization.",
	"portfolio": "My Portfolio",
	"portfolio-about": "My portfolio website showcases my projects, skills, and experience as a front-end developer. Built with React, Vite, TypeScript, and Tailwind CSS, it features a sleek and modern design with smooth transitions and a fully responsive layout. Optimized for performance, it ensures fast load times and an intuitive user experience. The site includes a dedicated section highlighting my tech stack, as well as a contact section for easy communication. More than just a website, it reflects my journey and passion for web development.",
	"todo": "To Do App",
	"todo-about": "This is a simple yet powerful To-Do application built with React. It allows users to add, delete, and edit tasks, assign due dates, and store data in the browser's local storage for persistence. The app offers an intuitive and responsive interface, making task management effortless. It’s an excellent example of my work with React, demonstrating my ability to create interactive applications with dynamic functionality and efficient state management.",
	"fifarobot": "FIFA Robot Host",
	"fifarobot-about": "FIFA bot created in Python, running on my virtual machine on VPS. The bot utilizes PyTesseract and other libraries to capture and process images, enabling the hosting and running of FIFA 11 games on GameRanger. It automates the process of launching and managing game sessions. The bot efficiently handles tasks like extracting match details from images, ensuring the correct setup for gaming sessions, and facilitating real-time interaction between players. It's a great work with game automation and image recognition to optimize gaming environments.",
	"technical-skills": "Technical Skills",
	"soft-skills": "Soft Skills",
	"HTML": "HTML",
	"CSS": "CSS",
	"JavaScript": "JavaScript",
	"React": "React",
	"TypeScript": "TypeScript",
	"Creativity": "Creativity",
	"Problem Solving": "Problem Solving",
	"Communication": "Communication",
	"Teamwork": "Teamwork",
	"Adaptability": "Adaptability",
	"Time Management": "Time Management",
	"Attention to Detail": "Attention to Detail",
	"Critical Thinking": "Critical Thinking",
	"Leadership": "Leadership",
	"Emotional Intelligence": "Emotional Intelligence",
	"Decision Making": "Decision Making",
	"Conflict Resolution": "Conflict Resolution",
	"Self-Motivation": "Self-Motivation",
	"Work Ethic": "Work Ethic",
	"Resilience": "Resilience",
	"connect": "Get In Touch",
	"connect-text": "I am looking for a full-time Front-End Developer opportunity! If this portfolio has caught your attention and you think I could be a part of your team, send me a message at ",
	"design": "Designed and Developed by Sergiu Tudos"
}