{
	"home": "Acasă",
	"projects": "Proiecte",
	"skills": "Abilități",
	"contact": "Contact",
	"welcome": "Bun venit în Lumea Mea Digitală!",
	"name": "Sunt Sergiu Tudos",
	"about": "Despre mine",
	"about-me": "Detaliat despre mine",
	"description-one": "Bună! Sunt Sergiu Tudos, un dezvoltator frontend pasionat, mereu dornic să învăț și să creez proiecte inovative. Lucrez cu tehnologii precum React, TypeScript, Vite și Tailwind, construind interfețe de utilizator intuitive și dinamice. Îmi place să rezolv probleme prin cod și să optimizez experiențele utilizatorilor.",
	"description-two": "Pe lângă programare, sunt implicat în organizarea și gestionarea turneelor FIFA 11, unde construiesc tabele de clasament dinamice, integrez funcționalități personalizate și caut constant modalități de a îmbunătăți experiența jucătorilor. Recent, am început să explorez crearea de boți Discord pentru a automatiza actualizările scorurilor în competițiile mele.",
	"description-three": "Scopul meu este să devin un dezvoltator web priceput, să îmi rafinez cunoștințele și să creez proiecte care aduc valoare comunității.",
	"my-projects": "Proiectele mele",
	"snake": "Jocul Snake",
	"snake-about": "Jocul Snake este primul meu proiect realizat cu TypeScript. L-am dezvoltat folosind React și am învățat concepte precum gestionarea stării cu hooks și mecanica mișcării bazată pe grilă. Am implementat detectarea coliziunilor, generarea merelor și creșterea șarpelui cu fiecare punct câștigat. Acest proiect m-a ajutat să înțeleg mai bine tiparea în TypeScript și să aplic principii fundamentale ale dezvoltării interactive.",
	"fifa": "Turnee FIFA",
	"fifa-about": "Website-ul meu pentru turnee a fost primul meu proiect major în React și este cel la care am lucrat cel mai mult. Am construit o platformă complexă pentru 50-100 de jucători care concurează pe parcursul anului. Am implementat recuperarea datelor din AWS buckets și le-am integrat în tabelul de clasament. De asemenea, am dezvoltat un bot Discord care rulează pe un server AWS, care permite jucătorilor să își trimită scorurile și actualizează automat clasamentele. Acest proiect a fost o mare experiență de învățare în dezvoltarea frontend, integrarea API-urilor și gestionarea datelor în timp real.",
	"horoscope": "Site Horoscop",
	"horoscope-about": "Zodiak a fost primul meu proiect realizat cu Vite, JavaScript, HTML și CSS și a fost, de asemenea, primul pentru care am cumpărat un domeniu și l-am făcut disponibil publicului pentru pasionații de horoscop. Am integrat un API folosind ChatGPT prin AWS Lambda, care generează o predicție zilnică pentru fiecare semn zodiacal. De asemenea, am optimizat site-ul pentru SEO pentru a îmbunătăți vizibilitatea și a ajunge la un public mai larg. Acest proiect a fost o mare experiență de învățare în integrarea API-urilor, funcțiile serverless și optimizarea performanței web.",
	"technical-skills": "Aptitudini Tehnice",
	"soft-skills": "Aptitudini Interpersonale",
	"HTML": "HTML",
	"CSS": "CSS",
	"JavaScript": "JavaScript",
	"React": "React",
	"TypeScript": "TypeScript",
	"Creativity": "Creativitate",
	"Problem Solving": "Rezolvare de Probleme",
	"Communication": "Comunicare",
	"Teamwork": "Lucru în Echipa",
	"Adaptability": "Adaptabilitate",
	"Time Management": "Gestionarea Timpului",
	"Attention to Detail": "Atenție la Detalii",
	"Critical Thinking": "Gândire Critică",
	"Leadership": "Leadership",
	"Emotional Intelligence": "Inteligență Emoțională",
	"Decision Making": "Luarea Deciziilor",
	"Conflict Resolution": "Rezolvarea Conflictelor",
	"Self-Motivation": "Auto-Motivație",
	"Work Ethic": "Etica Muncii",
	"Resilience": "Reziliență",
	"connect": "Ia legătura",
	"connect-text": "Caut o oportunitate full-time ca Front-End Developer! Dacă acest portofoliu ți-a atras atenția și crezi că aș putea face parte din echipa ta, trimite-mi un mesaj la ",
	"design": "Proiectat și dezvoltat de Sergiu Tudos"
}