{
	"home": "Главная",
	"projects": "Проекты",
	"skills": "Навыки",
	"contact": "Контакт",
	"welcome": "Добро пожаловать в мой цифровой мир!",
	"name": "Я Sergiu Tudos",
	"about": "Обо мне",
	"about-me": "Подробнее обо мне",
	"description-one": "Привет! Я Sergiu Tudos, страстный frontend разработчик, всегда готов учиться и создавать инновационные проекты. Я работаю с такими технологиями, как React, TypeScript, Vite и Tailwind, создавая интуитивно понятные и динамичные пользовательские интерфейсы. Мне нравится решать проблемы через код и оптимизировать пользовательский опыт.",
	"description-two": "Помимо программирования, я занимаюсь организацией и управлением турниров FIFA 11, где я строю динамичные таблицы лидеров, интегрирую пользовательские функции и постоянно ищу способы улучшить опыт игроков. Недавно я начал изучать создание ботов для Discord, чтобы автоматизировать обновление результатов в своих турнирах.",
	"description-three": "Моя цель - стать опытным веб-разработчиком, улучшить свои знания и создавать проекты, которые принесут пользу сообществу.",
	"my-projects": "Мои проекты",
	"snake": "Игра Snake",
	"snake-about": "Игра Snake — мой первый проект, созданный с использованием TypeScript. Я разработал его с использованием React и изучил такие концепты, как управление состоянием с помощью hooks и механика движения на сетке. Я реализовал обнаружение коллизий, генерацию яблок и рост змеи с каждым набранным очком. Этот проект помог мне лучше понять типизацию в TypeScript и применить основные принципы интерактивной разработки.",
	"fifa": "Турниры FIFA",
	"fifa-about": "Сайт для турниров был моим первым крупным проектом на React, и это тот проект, над которым я работал больше всего. Я создал сложную платформу для 50-100 игроков, которые соревнуются в течение года. Я реализовал получение данных из AWS buckets и интегрировал их в таблицу лидеров. Также я разработал бота для Discord, который работает на сервере AWS и позволяет игрокам отправлять свои результаты и автоматически обновлять таблицу. Этот проект стал отличным опытом обучения в frontend разработке, интеграции API и управлении данными в реальном времени.",
	"horoscope": "Сайт Гороскопа",
	"horoscope-about": "Zodiak был моим первым проектом, созданным с использованием Vite, JavaScript, HTML и CSS, а также первым, для которого я купил домен и сделал его доступным для поклонников гороскопов. Я интегрировал API с использованием ChatGPT через AWS Lambda, который генерирует ежедневный прогноз для каждого знака зодиака. Также я оптимизировал сайт для SEO, чтобы улучшить видимость и привлечь более широкую аудиторию. Этот проект стал отличным опытом в интеграции API, серверless-функциях и оптимизации веб-производительности.",
	"portfolio": "Моё портфолио",
	"portfolio-about": "Мой сайт-портфолио демонстрирует мои проекты, навыки и опыт в качестве фронтенд-разработчика. Созданный с использованием React, Vite, TypeScript и Tailwind CSS, он имеет современный и стильный дизайн, плавные переходы и полностью адаптивный макет. Оптимизированный для высокой производительности, сайт обеспечивает быструю загрузку и интуитивно понятный пользовательский интерфейс. Включает в себя раздел с используемыми технологиями, а также контактную секцию для удобной связи. Это не просто веб-сайт, а отражение моего пути и страсти к веб-разработке.",
	"todo": "Приложение To Do",
	"todo-about": "Это простое, но мощное приложение To-Do, созданное с использованием React. Оно позволяет пользователям добавлять, удалять и редактировать задачи, назначать сроки выполнения и хранить данные в локальном хранилище браузера для сохранности. Приложение предлагает интуитивно понятный и адаптивный интерфейс, что делает управление задачами легким. Это отличный пример моей работы с React, демонстрирующий мою способность создавать интерактивные приложения с динамической функциональностью и эффективным управлением состоянием.",
	"fifarobot": "FIFA Robot Host",
	"fifarobot-about": "FIFA бот, созданный на Python, который работает на моей виртуальной машине на VPS. Бот использует PyTesseract и другие библиотеки для захвата и обработки изображений, что позволяет хостить и запускать игры FIFA 11 на GameRanger. Он автоматизирует процесс запуска и управления игровыми сессиями. Бот эффективно выполняет задачи, такие как извлечение деталей матча из изображений, обеспечивая правильную настройку для игровых сессий и облегчая взаимодействие игроков в реальном времени. Это отличная работа с автоматизацией игр и распознаванием изображений для оптимизации игровых условий.",
	"technical-skills": "Технические навыки",
	"soft-skills": "Личные навыки",
	"HTML": "HTML",
	"CSS": "CSS",
	"JavaScript": "JavaScript",
	"React": "React",
	"TypeScript": "TypeScript",
	"Creativity": "Креативность",
	"Problem Solving": "Решение проблем",
	"Communication": "Коммуникация",
	"Teamwork": "Командная работа",
	"Adaptability": "Адаптивность",
	"Time Management": "Управление временем",
	"Attention to Detail": "Внимание к деталям",
	"Critical Thinking": "Критическое мышление",
	"Leadership": "Лидерство",
	"Emotional Intelligence": "Эмоциональный интеллект",
	"Decision Making": "Принятие решений",
	"Conflict Resolution": "Разрешение конфликтов",
	"Self-Motivation": "Самомотивация",
	"Work Ethic": "Рабочая этика",
	"Resilience": "Стойкость",
	"connect": "Связаться",
	"connect-text": "Я ищу работу Full-Time Front-End Developer! Если это портфолио привлекло ваше внимание и вы думаете, что я мог бы стать частью вашей команды, отправьте мне сообщение на ",
	"design": "Дизайн и разработка Sergiu Tudos"
}